Revit 2027 API
BuiltInFailures.StairRampFailures.WinderLegIsTooShortFailure Property
 A winder leg is too short.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WinderLegIsTooShortFailure { get; }
Public Shared ReadOnly Property WinderLegIsTooShortFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WinderLegIsTooShortFailure {
	FailureDefinitionId^ get ();
}
static member WinderLegIsTooShortFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace